app/controllers/entries_controller.rb

  def set_up_task
    @task = Task.find(params[:task_id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)

  def create
    @entry = Entry.new(params[:entry])
    @entry.task = @task

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("begin", "duration", "created_at", "updated_at", "task_id") VALUES('2011-02-09', 12.0, '2011-02-09 19:18:52', '2011-02-09 19:18:52', 1)