app/controllers/tasks_controller.rb

  def index
    @tasks = Task.find_all_by_user_id current_user.id
---
SELECT * FROM "tasks" WHERE ("tasks"."user_id" = 1)

  def create
    @task = Task.new(params[:task])
    @task.user_id = current_user.id
    if @task.save
---
INSERT INTO "tasks" ("description", "created_at", "updated_at", "user_id") VALUES('teste', '2011-02-09 19:18:46', '2011-02-09 19:18:46', 1)

  def time_sheet
    @from_date = Date.civil params[:date][:year].to_i, params[:date][:month].to_i, params[:date][:day].to_i
    @user = current_user
    @tasks = @user.tasks.select {|t| t.entries.detect {|e| e.begin >= @from_date && e.begin <= @from_date.end_of_month} }
---
SELECT * FROM "entries" WHERE ("entries".task_id = 1)
SELECT * FROM "tasks" WHERE ("tasks".user_id = 1)

  def time_sheet_download
    @empty_layout = true
    @from_date = Date.civil params[:date][:year].to_i, params[:date][:month].to_i, params[:date][:day].to_i
    @user = current_user
    @tasks = @user.tasks.select {|t| t.entries.detect {|e| e.begin >= @from_date && e.begin <= @from_date.end_of_month} }
---
SELECT * FROM "entries" WHERE ("entries".task_id = 1)
SELECT * FROM "tasks" WHERE ("tasks".user_id = 1)