app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_hash", "password_salt", "created_at", "updated_at") VALUES('ticolucci', 'ticolucci@gmail.com', '$2a$10$aDUAPU6QUbUUIhq1I.wkXuhUPuZhoAmgVUEkA07NQ3W6xMDKFthTq', '$2a$10$aDUAPU6QUbUUIhq1I.wkXu', '2011-02-09 19:18:30', '2011-02-09 19:18:30')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "password_salt" = '$2a$10$uVFRp5jLQz8n5fiBoZkObe', "password_hash" = '$2a$10$uVFRp5jLQz8n5fiBoZkObeIi.1vr1u8SKwZKn9W.CBsQl42qbgfuO', "updated_at" = '2011-02-09 19:18:42' WHERE "id" = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])